Repository: 84000/data-translation-memory
Catalog: toh216-v3.tmx
Source language: bo
Languages: en

source: སེམས་བསྐྱེད་པ་གང་ལས་བདུད་སྡིག་ཅན་གྱིས་གླགས་རྙེད་པར་མི་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་མཉེས་པར་འགྱུར་བ་དང་། ལྷ་དག་དགའ་བར་འགྱུར་བ་དང་། བདག་གི་དགེ་བའི་ཕྱོགས་ཡོངས་སུ་འབྲི་བར་མི་འགྱུར་བའི་སེམས་བསྐྱེད་པ་དེ་དག་ནི་བསྐྱེད་པར་བྱ་སྟེ།
en: Instead, bodhisattvas should develop attitudes that give the evil Māra no opportunity, please the thus-gone ones, bring the gods pleasure, and prevent their own virtuous qualities from diminishing.

source: དེ་དེ་ལྟར་ཞུགས་ན་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་འགྱུར་རོ།
en: If one proceeds in this way, one will turn the wheel of Dharma immediately upon developing the mind of awakening.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་རྒྱུ་དང་དམིགས་པའི་རྐྱེན་མ་སྐྱེས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་ཀྱང་མ་སྐྱེས་པ་ལས་རྟོགས་པར་འགྱུར་ལ།
en: Because immediately upon developing the mind of awakening, the bodhisattvas see that causes and observed conditions are unborn. Thus, they gain realization that all phenomena are nonoccurring and that the awakening of the Thus-Gone One is also unborn.

source: བྱང་ཆུབ་ཇི་ལྟ་བར་ཆོས་ཀྱི་འཁོར་ལོས་སྒྱུར་བ་ཡང་དེ་བཞིན་དུ་ཤེས་ཏེ།
en: They understand the turning of the wheel of Dharma according to their awakening.

source: སེམས་ཀྱི་བསམ་པའི་གོ་ཆ་དེ་དག་གིས་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་པར་ནུས་སོ།
en: They are able to comprehend omniscience through the armor of their thoughts.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཚིག་གི་རབ་ཏུ་ཐ་དད་པ་ཐམས་ཅད་ལ་སྤོབས་པས་སྨྲས་པ། སྐྱེས་བུ་དམ་པ་དག་བྱང་ཆུབ་ནི་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་སྟེ། ཀུན་ནས་ཉོན་མོངས་པའི་རྗེས་སུ་སོང་བ། རྣམ་པར་བྱང་བའི་རྗེས་སུ་སོང་བ། འདུས་བྱས་ཀྱི་རྗེས་སུ་སོང་བ། འདུས་མ་བྱས་ཀྱི་རྗེས་སུ་སོང་བ། ཟག་པ་དང་བཅས་པའི་རྗེས་སུ་སོང་བ། ཟག་པ་མེད་པའི་རྗེས་སུ་སོང་བ། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པའི་རྗེས་སུ་སོང་བ། ཁ་ན་མ་ཐོ་བ་མེད་པའི་རྗེས་སུ་སོང་བ།
en: The bodhisattva Eloquence Regarding All Distinct Terminology said, “Sublime beings, awakening is found in everything.

source: དགེ་བའི་རྩ་བའི་རྗེས་སུ་སོང་བ། མི་དགེ་བའི་རྩ་བའི་རྗེས་སུ་སོང་བ། འཇིག་རྟེན་གྱི་ཆོས་ཀྱི་རྗེས་སུ་སོང་བ། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཀྱི་རྗེས་སུ་སོང་བ། འཁོར་བའི་རྗེས་སུ་སོང་བ། མྱ་ངན་ལས་འདས་པའི་རྗེས་སུ་སོང་བ། ཆད་པ་དང་རྟག་པའི་རྗེས་སུ་སོང་བ། ཕུང་པོ་དང་།
en: It is found in affliction, purification, the conditioned, the unconditioned, the defiled, the undefiled, what is transgressive, what is not transgressive, roots of virtue, roots of nonvirtue, worldly phenomena, transcendent phenomena, saṃsāra, nirvāṇa, both disruption and permanence, the aggregates, the elements, and the sense sources.

source: ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་རྗེས་སུ་སོང་བ་སྟེ། སྐྱེས་བུ་དམ་པ་དག་བྱང་ཆུབ་ནི་ས་དང་ཆུ་དང་། མེ་དང་། རླུང་དང་། ནམ་མཁའི་རྗེས་སུ་སོང་བའོ།
en: Sublime beings, awakening is found in earth, water, fire, wind, and space.

source: ཆོས་ཐམས་ཅད་ནི་འདི་ལྟ་བུའི་རང་བཞིན་ཏེ། རང་བཞིན་སྟོང་པ་ཉིད་དོ།
en: All phenomena have a nature like this: the nature of emptiness.

source: །དེ་དག་ནི་བརྗོད་པ་གང་དང་གང་གིས་བརྗོད་པར་བྱ་བའི་རྣམ་པ་དེ་ཐམས་ཅད་སྟོང་པ་ཉིད་སྨོས་པར་བྱེད་པའོ།
en: Anyone who discusses these different aspects is discussing the emptiness of everything.

source: །འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའི་དབྱིངས་ནི་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་ངོ་། །དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱང་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་སྟེ།
en: To draw an analogy, just as space is found in everything, so is awakening found in everything.

source: སྐྱེས་བུ་དམ་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟ་བུའི་ཡེ་ཤེས་ལ་མོས་པ་ནི་དམིགས་པ་ཐམས་ཅད་ལ་སྤོབས་པ་འབྱུང་ཞིང་དེ་ནི་ཚིག་གི་རབ་ཏུ་ཐ་དད་པ་ཤེས་པ་ཐམས་ཅད་ཀྱང་འཐོབ་པར་འགྱུར་ཏེ།
en: Sublime beings, bodhisattvas who are devoted to such wisdom will arouse eloquence regarding all observations. In this they will gain all knowledge of distinct terminology.

source: ཚུལ་གཅིག་ལ་འཇུག་པ་དེས་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་སོ།
en: Those who understand the single principle will comprehend omniscience.”

source: །བྱང་ཆུབ་སེམས་དཔའ་སྤོབས་པའི་ཕུང་པོས་སྨྲས་པ། ཀྱེ་གྲོགས་པོ་དག་བརྗོད་པ་ཐམས་ཅད་ནི་བརྗོད་དུ་མེད་པ་སྟེ།
en: The bodhisattva Mass of Eloquence said, “Listen, friends!

source: སྒྲ་ཐམས་ཅད་བསྙད་དུ་མེད་པའོ།
en: All utterances are unutterable, and all sounds are unproduced.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་དེ་ལ་མོས་པ་ནི་སེམས་མི་གཡོ་བར་འདུག་པ་ཡིན་ཏེ། སྙན་པར་སྨྲས་པ་དང་། མི་སྙན་པར་སྨྲས་པ་ལ་དགའ་བ་དང་ཞུམ་པ་མེད་དོ།
en: Bodhisattvas devoted to such wisdom abide in unmoving minds such that they are neither pleased nor dismayed by pleasant or unpleasant speech.

source: །འདི་ལྟ་སྟེ། དཔེར་ན་རི་ལྷུན་པོའི་ཕུང་པོ་ལ་རླུང་བབ་པ་ལས་སླར་ལོག་ན་རི་ལྷུན་པོ་ནི་གཡོ་བའང་མེད། རབ་ཏུ་གཡོ་བའང་མེད་དོ།
en: Likewise, when wind reaches the imposing mass of a mountain, it turns back without moving or shaking that imposing mountain.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་འདྲ་བའི་ཡེ་ཤེས་རྟོགས་པས་ཐམས་ཅད་ཀྱི་སྒྲ་དང་བརྗོད་པ་ཀུན་བཟོད་དེ། གཡོ་བར་མི་བྱེད།
en: Likewise, Noble sons, by realizing such wisdom, a bodhisattva will accept sounds and utterances from all sources without moving or shaking.

source: རབ་ཏུ་གཡོ་བར་མི་བྱེད་ཅིང་ཕ་རོལ་མུ་སྟེགས་ཅན་གྱི་སྨྲ་བ་གང་ལ་ཡང་ཆགས་པར་མི་འགྱུར།
en: They are not drawn to the utterances of non-Buddhists.

source: དེ་བཞིན་གཤེགས་པའི་བཀའ་དང་། མུ་སྟེགས་ཅན་གྱི་ཚིག་ཀྱང་ཆོས་མཉམ་པ་ཉིད་དུ་མཐོང་།
en: They see the words of the Thus-Gone One and non-Buddhists to be sameness.

source: མཉམ་པ་ཉིད་ལའང་འགལ་བར་མི་བྱེད།
en: In this sameness there is no contradiction.

source: མུ་སྟེགས་ཅན་ཐམས་ཅད་ཀྱི་སྤོབས་པ་ཐམས་ཅད་ཀྱང་ཟད་པའི་ཆོས་སུ་མཐོང་། ཟད་པའི་ཆོས་ཀྱི་ཆོས་ལ་ང་རྒྱལ་ཆེན་པོར་ཡང་མི་བྱེད་དེ།
en: They see the eloquence of the non-Buddhists as limited, and limited phenomena could not prompt them to arrogance about phenomena.

source: སྐྱེས་བུ་དམ་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་དེ་འདྲ་བའི་ཡེ་ཤེས་ལ་མོས་པ་ནི་མྱུར་དུ་ཐམས་ཅད་མཁྱེན་པ་ཐོབ་པར་འགྱུར་རོ།
en: So, sublime beings, bodhisattvas who aspire to such wisdom shall swiftly gain omniscience.”

source: །བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་སྨྲས་པ། སྐྱེས་བུ་དམ་པ་དག་བྱང་ཆུབ་སེམས་དཔས་ཐོས་པ་ཐམས་ཅད་གཟུང་བའི་ཕྱིར་བློ་གྲོས་རྒྱ་མཚོ་ལ་སེམས་འཇུག་པ་རྟོགས་པར་བྱའོ།
en: The bodhisattva Sāgaramati said, “Sublime beings, bodhisattvas must comprehend how to plunge the mind into the ocean of intelligence since they retain all they hear.

source: །ཆོས་ཉིད་ལ་སྣ་ཚོགས་མེད་པའི་ཕྱིར་དེས་ཆོས་རོ་གཅིག་པ་ལ་མོས་པར་བྱའོ།
en: They must be devoted to the quality of a single taste since reality does not vary.

source: །རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་མི་འགལ་བའི་ཕྱིར་དེས་ཆོས་ཉིད་ལ་བརྟག་པར་བྱའོ།
en: They must investigate reality since it does not contradict dependent origination.

source: །ཐོག་མ་ནས་མ་སྐྱེས་པའི་ཕྱིར་ཆོས་གང་ཡང་མ་བྲི་བ་དང་མ་འཕེལ་བར་བྱའོ།
en: They must not attempt to increase or diminish any phenomena, since phenomena are primordially nonoccurring.

source: །བསོད་ནམས་མི་ཟད་པའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚོ་བའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་བྱའོ།
en: They must grow the roots of virtue that nourish all beings, since their merit is inexhaustible.

source: །ཆད་པ་དང་རྟག་པ་ལས་དབེན་པའི་ཕྱིར་དེས་མཐའ་གཉིས་རྟོགས་པར་བྱའོ།
en: They must comprehend the two extremes since they are disengaged from discontinuity and permanence.

source: །སེམས་ཀྱི་སྒོམ་པ་ཚད་མེད་པའི་ཕྱིར་དེས་ཆོས་ཐམས་ཅད་ལ་བརྟག་པར་བྱའོ།
en: They must investigate all phenomena since the mind’s capacity to be cultivated is limitless.

source: །ཆོས་ཡང་དག་པར་མི་བརྗེད་པའི་ཕྱིར་བདག་གི་དྲན་པའི་སྟོབས་བསྐྱེད་པ་ཡང་ཡོངས་སུ་གཞག་པར་བྱའོ།
en: They must develop the strength of their mindfulness and apply it so as not to forget any phenomena.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་སྙོམས་པར་ཆོས་འཆད་པའི་ཕྱིར་དེས་སྙེམས་པ་ཐམས་ཅད་ཡང་དག་པར་བཅོམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: They must complete the elimination of any arrogance since they are to teach the Dharma to all beings equally.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལྷུར་བྱེད་པའི་ཕྱིར་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་དང་མི་འགྲོགས་པར་བྱའོ།
en: In order to assiduously pursue the unique qualities of buddhahood, they must not associate with any nonvirtuous qualities.

source: །སྐྱེས་བུ་དམ་པ་དག་དྲན་པའི་ཡེ་ཤེས་ཀྱི་གོ་ཆ་དེས་ནི་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་པར་ནུས་སོ།
en: Sublime beings, through the armor of mindful wisdom, one will be able to comprehend omniscience.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ལྷུན་པོ་ཆེན་པོས་སྨྲས་པ་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་དེ་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པའི་ཡེ་ཤེས་ཏེ།
en: The bodhisattva Mahāmeru said, “This wisdom of the buddhas is wisdom that rises above the entire world.

source: དེ་ནི་ཚད་ཡོད་པའི་སྤྱོད་པས་རྟོགས་པར་མི་ནུས་སོ།
en: One cannot comprehend it via any kind of limited action.

source: །དེ་བས་ན་བསམ་པ་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་དང་། ཐོས་པ་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་དང་། དད་པ་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་དང་། སྦྱིན་པ་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་དང་། དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་།
en: Therefore, one will be able to comprehend omniscience with thought that rises above the entire world, hearing that rises above the universe, faith that rises above the entire world, and generosity that rises above the entire world, and likewise with discipline, patience, diligence, concentration, and insight that rise above the entire world as well as merit like the massive Mount Meru that rises above the entire world.”

source: བསམ་གཏན་དང་། ཤེས་རབ་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་དང་། བསོད་ནམས་རི་རབ་ལྷུན་པོ་བཞིན་དུ་མངོན་པར་འཕགས་པས་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་པར་ནུས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་མཐོང་ན་དགའ་བས་སྨྲས་པ། སྐྱེས་བུ་དམ་པ་དག་གང་གི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་བདག་གི་གཟུགས་ཀྱི་སེམས་ཡོངས་སུ་དག་པས་གཟུགས་སུ་སྣང་བ་ཡིད་དུ་མི་འོང་བ་གང་ཡང་མིག་གིས་མཐོང་ཞིང་སྣང་བར་མི་འགྱུར།
en: The bodhisattva Priyadarśa said, “Sublime beings, when bodhisattvas purify their consciousness of form, unpleasant appearances of form will not appear to their eyes.

source: བདག་གི་རྣ་བའི་སེམས་ཡོངས་སུ་དག་པས་སྒྲ་ཡིད་དུ་མི་འོང་བ་གང་ཡང་རྣ་བས་ཐོས་ཤིང་གྲག་པར་མི་འགྱུར།
en: When they purify their ear consciousness, unpleasant sounds will not be heard by their ears.

source: དེ་བཞིན་དུ་དྲི་ཡང་མ་ཡིན། རོ་ཡང་མ་ཡིན།
en: The same holds for scent, taste, and touch.

source: རེག་ཀྱང་མ་ཡིན། རང་གི་ཡུལ་གྱི་སེམས་ཡོངས་སུ་དག་པས་ཆོས་ཡིད་དུ་མི་འོང་བ་གང་ཡང་ཡིད་ལ་སྣང་བར་མི་འགྱུར།
en: When they purify the domain of their minds, unpleasant mental objects will no longer appear to their minds.

source: རང་གི་སེམས་ཡོངས་སུ་དག་པས་ཡིད་དགའ་བ་དང་། མི་དགའ་བ་དང་། མ་འབྲེལ་ཅིང་སེམས་ཅན་གང་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྣོད་མ་ཡིན་པར་མ་མཐོང་སྟེ། གང་ལོག་པར་ངེས་པ་དེ་དག་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྣོད་དུ་འགྱུར་བར་མཐོང་ཞིང་།
en: When they purify their minds, their minds will no longer be bound by like and dislike, and they will not see any being as an unsuitable vessel for the qualities of buddhahood, for they will see even those with mistaken convictions as suitable vessels for the qualities of buddhahood.

source: གང་བདག་ཤིན་ཏུ་དགའ་བར་གྱུར་པའི་དངོས་པོ་དེ་དགའ་ཞིང་ཡོངས་སུ་གཏོང་ལ་བྱིན་ནས་ཀྱང་མི་འགྱོད་པ་ཡིན་ཏེ།
en: Anything that they really enjoy, they will joyfully renounce and give away without regret.

source: དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་པར་ནུས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་རབ་དུ་དགའ་བའི་རྒྱལ་པོས་སྨྲས་པ། གང་གི་ཚེ་ན་སྤྱོས་པ་དང་། བརྒྱད་པ་དང་།
en: Bodhisattvas who act like this will be able to comprehend omniscience.”

source: སྨད་པ་དང་། བརྙས་པ་དང་། བརྡེགས་པ་དང་། ཚར་བཅད་ན་བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་དགའ་བ་སྐྱེད་ཅིང་གང་ཟག་དེ་ལ་ཡང་དགེ་བའི་བཤེས་གཉེན་དུ་འདུ་ཤེས་སྐྱེད་ལ།
en: The bodhisattva Joyful King said, “When criticized, scolded, blamed, bullied, beaten, or defeated, bodhisattvas should be joyful and regard the person who does so as a spiritual friend.

source: བཟོད་པར་བྱེད། བཟོད་པའི་མཐུ་སྟོན་ཅིང་རབ་ཏུ་དགའ་བ་སྐྱེས་ནས་སྤྱོ་བར་བྱེད་པ་འདི་སུ།
en: Practicing patience and showing the power of patience, they will be joyful.

source: གང་ལ་སྤྱོ་བར་བྱ་ཞེས་དེ་ཆོས་ཉིད་ཀྱི་རྗེས་སུ་འཇུག་པར་བྱེད།
en: They investigate reality by asking themselves, ‘Who is this person that criticizes, and what is being criticized?’

source: ནང་གི་སྟོང་པ་ཉིད་ལ་མོས་ཤིང་ཕྱིའི་སྟོང་པ་ཉིད་ལ་ཐེ་ཙོམ་མེད་པས་བདག་ཏུ་ལྟ་བའང་མི་སྐྱེད་ཅིང་བཟོད་ལ།
en: Being confident in inner emptiness and trusting of outer emptiness, they are patient and refrain from developing the view of self.

source: རྐང་པ་དང་ལག་པ་ཡོངས་སུ་གཏོང་བ་དང་།
en: Thus they can give away their arms and legs.

source: མིག་དང་མགོ་ཡོངས་སུ་གཏོང་བ་དང་།
en: They can give away their eyes and head.

source: ཆུང་མ་དང་། བུ་ཕོ་དང་བུ་མོ་ཡོངས་སུ་གཏོང་བ་དང་།
en: They can give away their wives, sons, and daughters.

source: རྒྱལ་སྲིད་ཡོངས་སུ་གཏོང་བས་རབ་ཏུ་དགའ་བ་ཡིན།
en: They can give away their kingdom and be joyful about it.

source: ལུས་དང་སྲོག་ཡོངས་སུ་གཏོང་བས་དགའ་བ་ཡིན་ཏེ།
en: They can give up their body and life and be happy about it.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཐོབ་པས་དགའ་བ་མ་ཡིན་གྱི། ལེགས་པར་བཤད་པ་ཚིགས་སུ་བཅད་པ་གཅིག་ཐོས་པས་ཤིན་ཏུ་དགའ་བ་ཡིན།
en: For while they would not be happy about gaining the dominion of a universal monarch, they are joyful in hearing a single well-spoken verse.

source: བརྒྱ་བྱིན་ཐོབ་པས་དགའ་བ་མ་ཡིན་གྱི། གཞན་ཆོས་འཆད་པ་ལ་ཤིན་ཏུ་དགའ་བ་ཡིན།
en: Gaining the status of Śakra would not make them happy, yet they are joyful when explaining the Dharma to others.

source: ཚངས་པ་ཐོབ་པས་དགའ་བ་མ་ཡིན་གྱི། སེམས་ཅན་གཅིག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཞག་ན་རབ་ཏུ་དགའ་བ་ཡིན།
en: Gaining the status of Brahmā would not make them happy, yet they are joyful when they are able to establish even a single being in unsurpassed and perfect awakening.

source: སྟོང་གསུམ་རིན་པོ་ཆེས་བཀང་བས་དགའ་བ་མ་ཡིན་གྱི། དེ་བཞིན་གཤེགས་པ་མཐོང་བས་རབ་ཏུ་དགའ་བ་ཡིན་ཏེ།
en: The trichiliocosm filled with precious substances would not make them happy, but they are joyful when they behold the Thus-Gone One.

source: དེ་ནི་གཞར་ཡང་དབང་པོ་ཉམས་པར་མི་འགྱུར་ཞིང་དགའ་བར་གྱུར་ནས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དགའ་ཞིང་མགུ་བའི་སྤྱོད་པ་འདིས་སྒྲུབ་པར་བྱེད་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་པར་ནུས་སོ།
en: They are happy, as their faculties never decline. Anyone who accomplishes such conduct and who is happy and joyful about the factors of awakening is able to comprehend omniscience.”

source: །བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་མཐོང་བས་སྨྲས་པ། སྐྱེས་བུ་དམ་པ་དག་གང་གི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་མཐོང་མོད་ཀྱི། བདག་ཏུ་ལྟ་བར་ཡང་མི་ལྟུང་།
en: The bodhisattva Infinite Vision said, “Friends, while indeed a bodhisattva sees all phenomena, they do not fall into the view of self.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཤེས་མོད་ཀྱི། རྣམ་པར་རྟོག་པ་སྤྱོད་པ་ཡང་མ་ཡིན།
en: While indeed they understand all the qualities of buddhahood, they do not indulge in concepts.

source: སངས་རྒྱས་ཐམས་ཅད་མཐོང་མོད་ཀྱི། གཟུགས་ལ་དམིགས་པའི་འདུ་ཤེས་ཀྱང་མི་སྐྱེད།
en: While indeed they see all the buddhas, they do not generate the notion that they are observing form.

source: སེམས་ཅན་ཐམས་ཅད་མཐོང་མོད་ཀྱི་སེམས་ཅན་དུ་འདུ་ཤེས་ཀྱང་མི་སྐྱེད།
en: While indeed they see all beings, they do not generate notions about beings.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡོངས་སུ་དག་པའི་ཕྱིར་ཤའི་མིག་གསལ་བར་གྱུར་པ་ཡིན།
en: Their physical eyes are clear because they have purified the ripening of action.

source: མངོན་པར་ཤེས་པ་ཐོབ་པས་ལྷའི་མིག་དང་ལྡན་པ་ཡིན།
en: They possess the divine eye because they have gained extraordinary abilities.

source: ཉོན་མོངས་པ་ཐམས་ཅད་དང་བྲལ་བས་ཤེས་རབ་ཀྱི་མིག་རྟོགས་པར་ཁོང་དུ་ཆུད་པ་ཡིན།
en: They have realized the eye of insight by ridding themselves of all afflictions.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་སྒྲུབ་པས་སངས་རྒྱས་ཀྱི་སྤྱན་ལ་མོས་པ་ཡིན།
en: They are oriented toward the eye of buddhahood by accomplishing the unique qualities of buddhahood.

source: སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་པས་ཆོས་ཀྱི་སྤྱན་སྣང་བ་ཐོབ་པ་ཡིན་ཏེ།
en: They gain the insight of the Dharma eye by perfecting the ten strengths.

source: རིགས་ཀྱི་བུ་དེ་འདྲ་བའི་ཡེ་ཤེས་མཐོང་བ་ཡོངས་སུ་རྫོགས་པས་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་པར་ནུས་སོ།
en: Noble sons, through the perfection of such wisdom vision, one will be able to comprehend omniscience.”

source: །བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་དམིགས་པར་གནས་པས་སྨྲས་པ། བྱང་ཆུབ་ནི་ཐམས་ཅད་དམིགས་པ་སྟེ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སྒྲུབ་པར་འགྱུར་རོ།
en: The bodhisattva Abiding in Limitless Observations said, “In awakening everything is observed, and the wisdom of omniscience is accomplished.

source: དམིགས་པ་ཐམས་ཅད་ནི་ནང་ན་ཡང་མི་གནས། ཕྱི་རོལ་ན་ཡང་མི་གནས། དབུས་ན་ཡང་མི་གནས་པར་བརྟག་པར་བྱའོ།
en: Because bodhisattvas investigate the fact that no observations exist internally, externally, or in the middle.

source: །བྱང་ཆུབ་སེམས་དཔའ་དམིགས་པ་ལ་མི་གནས་པ་ནི་ཉོན་མོངས་པ་ལ་དམིགས་པ་དང་། ལས་ལ་དམིགས་པ་དང་། བདུད་ལ་དམིགས་པས་ཉམས་པར་མི་འགྱུར་ཏེ།
en: A bodhisattva who does not abide in observation will not be harmed by the observation of afflictions, action, or Māra.

source: ལས་དང་། ཉོན་མོངས་པ་དང་། བདུད་ལ་དམིགས་པ་ལས་འདས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་སོ།
en: A bodhisattva who transcends the observation of afflictions, action, and Māra comprehends omniscience.”

source: །བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཀྱི་ལྟ་བ་ཡང་དག་པར་འཇོམས་པས་སྨྲས་པ། རིགས་ཀྱི་བུ་བདག་ཏུ་ལྟ་བ་ནི་བདག་ཏུ་ལྟ་བ་ལས་ལྡང་ཞིང་བྱུང་བ་ཡིན།
en: The bodhisattva Destroyer of the Views of Māra said, “Noble sons, the view of self arises and occurs from the view of self.

source: བདུད་ཀྱི་ལས་ནི་ལྟ་བ་ལས་ལྡང་ཞིང་བྱུང་བ་སྟེ།
en: The actions of Māra arise and occur from this view.

source: བདག་ཏུ་ལྟ་བ་ཡོངས་སུ་ཤེས་ན་ལྟ་བ་འབྱུང་བར་མི་བྱེད་དོ།
en: If one understands the view of self, one will not cause such views to occur.

source: །ལྟ་བ་ཡོངས་སུ་ཤེས་ན་ཕུང་པོ་འབྱུང་བར་མི་བྱེད་དོ།
en: If one understands such views, one will not cause the aggregates to occur.

source: །ཕུང་པོ་ཡོངས་སུ་ཤེས་ན་བདུད་མི་མཐོང་ངོ་།
en: If one understands the aggregates, one will not see Māra.

source: །བདུད་ཀྱི་ཡུལ་ལས་འདའ་བར་བྱ་བའི་ཕྱིར་སྒྲིབ་པ་མེད་པའི་རྣམ་པར་ཐར་པ་ལ་རེག་པར་འགྱུར་རོ།
en: One will reach unobscured freedom because one has transcended the domain of Māra.

source: །བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་མེད་པའི་རྣམ་པར་ཐར་པ་ཐོབ་ན་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་སོ།
en: If bodhisattvas achieve unobscured freedom, they will comprehend omniscience.”

source: །བྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་མེད་སྦྱིན་གྱིས་སྨྲས་པ། ལས་ཉེས་པ་བྱེད་པ་ནི་ཕྱིས་འགྱོད་པར་འགྱུར། ལས་ལེགས་པར་བྱེད་པ་ནི་ཕྱིས་མྱ་ངན་བྱེད་པར་མི་འགྱུར་རོ།
en: The bodhisattva Aśokadatta said, “Performing faulty actions will later cause one to be remorseful, whereas good actions will not cause one any anguish later.

source: །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ལས་ལེགས་པ་བྱེད་པ། ལས་མི་སྨད་པ་བྱེད་པ། ལས་མི་འགྱོད་པ་བྱེད་པ། ལས་ཁ་ན་མ་ཐོ་བ་མེད་པ་བྱེད་པར་བྱའོ།
en: Therefore, bodhisattvas must engage in good actions, irreproachable actions, actions that will not cause remorse, and actions that are not evil.

source: །སེམས་ཅན་མྱ་ངན་གྱི་ཟུག་རྔུས་ཟུག་པ་རྣམས་ཀྱང་མྱ་ངན་ཞི་བར་བྱ་བ་དང་། ཟུག་རྔུ་དང་བྲལ་བར་བྱ་བའི་ཕྱིར་ཆོས་བཤད་པར་བྱ་སྟེ།
en: They will preach the Dharma in order to quell the misery and end the anguish of suffering beings.

source: དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་སོ།
en: Bodhisattvas who act like this will comprehend omniscience.”

source: །བྱང་ཆུབ་སེམས་དཔའ་དོན་ཐམས་ཅད་གྲུབ་པས་སྨྲས་པ། རིགས་ཀྱི་བུ་དག་སྐྱེས་བུ་གང་ཟག་ཚུལ་ཁྲིམས་དང་ལྡན་པའི་སེམས་ཀྱི་སྨོན་པ་འགྲུབ། སྨོན་ལམ་འགྲུབ་པར་འགྱུར་ལ། ཚུལ་ཁྲིམས་ཀྱི་རྩ་བ་ལ་ཡང་བག་བྱེད་པ་རྟེན།
en: The bodhisattva Sarvārthasiddha said, “Noble sons, people who have a disciplined mind will accomplish their aims and aspirations.

source: བག་བྱེད་པའི་རྩ་བ་ལ་ཡང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་རྟེན། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཀྱི་རྩ་བ་ལ་ཡང་ཐམས་ཅད་མཁྱེན་པ་རྟེན་ཏོ།
en: The factors of awakening rest upon the foundation of carefulness, and omniscience rests upon the foundation of the factors of awakening.

source: །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་བག་བྱེད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ལ་རྟེན་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་སོ།
en: Therefore, a bodhisattva who depends upon carefulness and the factors of awakening will comprehend omniscience.”

source: །ལྷའི་བུ་ཀུན་ནས་མེ་ཏོག་གིས་སྨྲས་པ། རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ཤིང་མེ་ཏོག་གིས་བརྒྱན་པ་ནི་འགྲོ་བ་མང་པོའི་ཉེ་བར་འཚོ་བ་ཡིན་ནོ།
en: The god Samantakusuma said, “Noble sons, to draw an analogy, a tree adorned by flowers will nourish many beings.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་ཐར་པའི་ཆོས་ཀྱི་མེ་ཏོག་རྒྱས་པ་ནི་འགྲོ་བ་མང་པོའི་ཉེ་བར་འཚོ་བ་ཡིན་ནོ།
en: Likewise, noble sons, bodhisattva great beings who open the flower of the Dharma of liberation will nourish many beings.

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ལྷ་རྣམས་ཀྱི་ཤིང་པ་རི་ཡ་ཏྲ་ཀ་ཀོ་བ་དི་ར་མེ་ཏོག་རྒྱས་ན་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་བུ་རྣམས་མངོན་པར་འདུ་བར་འགྱུར་རོ།
en: Noble sons, to draw an analogy, when the flowers on the divine pāriyātrakakovidāra tree bloom, it attracts the gods of the Heaven of the Thirty-Three.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་ཐར་པའི་ཆོས་ཀྱི་མེ་ཏོག་རྒྱས་ན་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་མངོན་པར་འདུ་བར་འགྱུར་རོ།
en: Likewise, noble sons, a bodhisattva great being who opens the flower of the Dharma of liberation will attract the world and its gods.

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ལྷའི་ནོར་བུ་རིན་པོ་ཆེ་སྐྱོན་ཐམས་ཅད་དང་བྲལ་ལ་ཡོན་ཏན་ཐམས་ཅད་དང་ལྡན་པ་དེ་བཞིན་དུ།
en: Noble sons, to draw an analogy, the precious gem of the gods is free of all imperfections and has all positive attributes.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བསམ་པ་ཡོངས་སུ་དག་པ་སྐྱོན་ཐམས་ཅད་དང་བྲལ་ལ་ཡོན་ཏན་ཐམས་ཅད་དང་ལྡན་པས་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་སོ།
en: Likewise, Noble sons, a bodhisattva with pure thought who is free from all imperfections and has all positive qualities will comprehend omniscience.”

source: །ལྷའི་བུ་མེ་ཏོག་འོད་ཟེར་ཅན་གྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མའི་འོད་ཟེར་བཏང་ན་མུན་པ་བསལ་ཅིང་གཟུགས་ཀྱི་རྣམ་པ་ཐམས་ཅད་སྣང་བར་འགྱུར་རོ།
en: The god Luminous Flower said, “Noble sons, to draw an analogy, when the sun shines its light, it eliminates darkness and illuminates all the aspects of form.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་སྣང་བའི་འོད་ཟེར་དང་ལྡན་པ་ཡང་གང་གི་ཚེ་ན་ཆོས་ཀྱི་སྣང་བ་གཏོང་བ་དེའི་ཚེ། མ་རིག་པ་དང་གླེན་པའི་མུན་པས་བསྒྲིབས་པའི་སེམས་ཅན་རྣམས་ལ་སྣང་བ་ཆེན་པོ་བྱེད་ཅིང་ཆོས་ཀྱི་རང་བཞིན་ཡང་སྟོན་ཏེ།
en: Likewise, Noble sons, when bodhisattvas endowed with the light of insight shine the light of Dharma, they profoundly illuminate those beings who are obscured by the darkness of delusion and stupidity, and they reveal the nature of phenomena.

source: མུན་པས་ནི་སྣང་བ་ཟིལ་གྱིས་ནོན་པར་མི་འགྱུར་གྱི། སྣང་བས་ནི་ལམ་རྟོགས་པར་ནུས་པས་བྱང་ཆུབ་སེམས་དཔའ་ལམ་ལ་གནས་ན་སེམས་ཅན་ལམ་ངན་པར་ཞུགས་པའི་རྣམས་ལ་ཡང་དག་པའི་ལམ་སྟོན་ཏེ།
en: No darkness can overwhelm this light, and this light brings comprehension of the path. Therefore, bodhisattvas abiding on the path can show the correct path to beings who travel bad paths.

source: བྱང་ཆུབ་སེམས་དཔའ་ལམ་ལ་གནས་ན་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་སོ།
en: When bodhisattvas abide on the path, they will comprehend omniscience.”

source: །ལྷའི་བུ་མེ་ཏོག་མན་དཱ་ར་བའི་དྲིས་སྨྲས་པ། །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ་དཔེར་ན། མེ་ཏོག་མན་དཱ་ར་བའི་ཁོ་ར་ཁོར་ཡུག་དཔག་ཚད་གཅིག་ཏུ་དྲིས་ཁྱབ་པར་བྱེད་དེ། དྲི་དེ་ཡང་རྣམ་པར་རྟོག་པ་མེད་དོ།
en: The god Māndārava Scent said, “Noble sons, to draw an analogy, the scent of a māndārava flower pervades the environment for an entire league, yet the scent does not form any concepts.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་གཏོང་བ་དང་། ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་ལ་གནས་པ་ཡང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་དྲིས་ཁྱབ་པར་བྱེད་དེ།
en: Similarly, Noble sons, a bodhisattva grounded in generosity, discipline, hearing, absorption, and insight fills the trichiliocosm with the scent of the Dharma.

source: དྲི་དེ་ཡང་ཉོན་མོངས་པའི་ནད་ཐམས་ཅད་སེལ་བར་བྱེད་དོ།
en: This scent eliminates all the illnesses of affliction.

source: །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དྲི་དང་ལྡན་ན་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་སོ།
en: Therefore, if a bodhisattva is endowed with the scent of the Dharma, they will comprehend omniscience.”

source: །ལྷའི་བུ་ཆོས་ལ་གནས་པ་རྟག་ཏུ་བརྩོན་པས་སྨྲས་པ།
en: The god Constantly Striving to Abide by the Dharma said, “Listen, friends!

source: ཀྱེ་གྲོགས་པོ་དག་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་པས་བྱང་ཆུབ་པར་འགྱུར་གྱི།
en: Bodhisattvas will awaken through exertion, whereas they will not do so without it.

source: མི་བརྩོན་པས་ནི་མ་ཡིན་ནོ། །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྟག་པར་བརྩོན་ཞིང་དགེ་བའི་རྩ་བ་ལ་ཆོག་མི་ཤེས་པར་བྱའོ།
en: Therefore, bodhisattvas should constantly exert themselves and never be complacent regarding their roots of virtue.
